Repository: sammagafu/weXchange
Catalog: lib/l10n/intl_*.arb
Languages: sw

# welcometext
source: welcome to weXchange App, Choose your Language
sw: Karibu weXchange App,Chagua lugha yako

# slogan
source: Mobile Money Simplified
sw: Pesa mtandaoni ULIPO

# caccount
source: Create Account
sw: Fungua Akaunti

source: Login
sw: Ingia

# disclaimer
source: Currently this app doesn't handle any transaction
sw: Kwa sasa programu hii haishughulikii muamala wowote

source: Welcome
sw: Karibu

# fullname
source: Enter your full name
sw: Ingiza Majina yako kamili

# ihaveaccount
source: I have account, Login
sw: Nina akaunti, Ingia

# loginbtn
source: Login to your account
sw: Ingia kwenye akaunti yako

source: Home
sw: Nyumbani

source: Deposit
sw: Kuweka

source: Withdraw
sw: Kutoa

# activities
source: Transactions
sw: Miamala

source: Settings
sw: Mipangilio

# goonline
source: Go Offline
sw: Toka mtandaoni

# lookingforclinets
source: Looking for requests please wait ...
sw: Tunatafuta maombi tafadhali subiri...

# acceptnearn
source: Accept requests transact and get commission
sw: Kubali maombi na upate kamisheni

# mno
source: Mobile Network Operators
sw: Mitandao ya simu

# bank
source: Banks
sw: Banki

source: Update Profile
sw: Sahihisha maelezo mafupi

source: Logout
sw: Toka

source: Service Provider
sw: Mtoa huduma

source: Service
sw: Huduma

# depositamount
source: Amount
sw: Kiasi

# depositcharges
source: Deposit Charges & Commissions
sw: Malipo na kamisheni

# accept
source: Accept Request
sw: Kubali Ombi

# decline
source: Decline Request
sw: Kubatilisha Ombi

source: Charges
sw: Makato

# transactionInfo
source: Transaction information
sw: Taarifa za muamala

# totalpay
source: Total amount to pay
sw: Jumla ya kiasi cha kulipa

# totalreceive
source: Total amount to receive
sw: Jumla ya kiasi cha kupokea

# finish
source: Finish Transaction
sw: Kamilisha Shughuli

# rate
source: Thanks for choosing us, Please rate the service
sw: Asante kwa kutuchagua, Tafadhali kadiria huduma

source: Go Back
sw: Rudi Nyuma

# connecting
source: Connecting to nearby user
sw: Inaunganisha kwa mtumiaji aliye karibu

# cancelTransaction
source: Cancell Transaction
sw: Sitisha Muamala

source: Enter amount
sw: Ingiza Kiasi

# limitamount
source: The maximum amount is TZS 100,000
sw: Kiwango cha juu zaidi cha kutoa au kuweka ni TZS 100,000

# distancebtn
source: Distance between you & customer
sw: Umbali kati yako na mteja
